#include <stdio.h>//підключення бібліотек
#include<locale.h>
#include<math.h>
int main() {

    int x; //оголошення локальних змінних
    int y;
    setlocale(LC_CTYPE, "ru");//підключення підтримки кирилиці російської мови//
    printf("Введ1ть число x:   \n");//виведення тексту на екран//
    scanf("%d", &x);//введення значення зміної x//

    y = pow (x, 3) - 4 * pow (x,2) - 5 * x + 9 + cos (x) ; 
    printf("\tx \t y \n");//виведення тексту на екран//
    printf("\t%d \t %d\n", x, y);//виведення тексту на екран//


    return 0;//вих1д 1з програми //
}
